{
    "mainName": "John Paul Justice",
    "navAbout": "Experience",
    "navContact": "Contact Me",
    "navProjects": "Skill Stack",
    "navTitle": "Home",
    "aboutMe": "About Me",
    "photoOfMe": "Recent Photo:",
    "mainTitle": "Cloud Solutions Consultant",
    "mainSummary": "As an experienced engineer, I have a deep-seated passion for building and maintaining top-tier software systems. I’ve worked in diverse sectors including government, healthcare, and gaming. My expertise lies in troubleshooting, architecture, CI/CD, devops, site reliability, software methodologies, and the application of best practices and adopted patterns. I thrive on working with the latest technologies, including AI prompt crafting/engineering, retrieval augmented generation(RAG) and untangling complex problems. I’m always on the lookout for opportunities to learn new skills and refine my existing ones. I’m currently seeking a challenging and fulfilling role where I can leverage my skills to contribute to an organization’s success.",
    "mainContactMe": "Professional Links",
    "mainExperience": "Experience",
    "nautilusName": "Nautilus Inc.",
    "nautilusPostition": "Senior SRE /Senior Software Engineer",
    "nautilusEmpTime": "Aug 2018 - Sept 2019",
    "jgName": "Jahnel Group",
    "jgPosition": "Senior SRE /Senior Software Engineer",
    "jgEmpTime": "Sept 2019 - Present",
    "capsaEmpTime": "Aug 2016 - Aug 2018",
    "integraEmpTime": "Aug 2015 - Aug 2016",
    "engilityEmpTime": "Aug 2014 - Aug 2015",
    "nautilusSummary1": "Set up application monitoring for a Kubernetes cluster, synthetic testing, logging, tooling automation, Terraform templates, task automation, and webhook integrations for proprietary applications and business operations.", 
    "nautilusSummary2":"Automate business operations, standardize source control with GIT-flow, create application pipelines for EC2 instances and Lambdas, and create CloudFormation templates.",
    "nautilusSummary3":"Support and create serverless microservices in C#, Python3.6, and NodeJs.",
    "jgSummary1": "Pioneered a platform that empowers engineers to deploy services seamlessly with zero downtime, equipped with comprehensive monitoring, SLAs, and alerting mechanisms, ensuring optimal service performance and reliability.",
    "jgSummary2": "Oversee the backend services of game studios by developing, testing, launching, maintaining, and monitoring microservices/applications.",
    "jgSummary3": "Constructed and maintained a multi-regional cloud infrastructure that guarantees high availability, effectively accommodating the dynamic needs of the user base and enhancing service resilience.",
    "jgSummary4": "Applied AI techniques like prompt engineering and RAG to build an efficient AI Chat Agent providing accurate and reliable information extracted and indexed from proprietary company data.",
    "jgSummary5": "Developed an automated system for GitHub Pull Requests, improving team productivity and code quality.",
    "jgSummary6": "Executed continuous integration and delivery of new microservices/applications and resolved large-scale deployment issues on Linux and Windows systems within a Kubernetes environment.",
    "capsaName": "Capsa Healthcare",
    "capsaTitle": "Senior Software Engineer",
    "capsaSummary1": "Researched, innovated, and designed scalable applications for software, firmware, and interfaces.",
    "capsaSummary2": "Implemented new utilities, data configuration, and data extraction for the application infrastructure.",
    "capsaSummary3": "Prototyped new capabilities and migrated Azure Data server, cloud services, and web applications.",
    "integraName": "Integra telecom",
    "integraTitle": "Software Engineer",
    "integraSummary1": "As a full-stack system engineer, completed tasks from stories, bugs, and other product backlog items/epics.",
    "integraSummary2": "Implemented deployment builds with unit tests and locked check-ins.", 
    "integraSummary3": "Redesigned the customer website portal for optimal mobile capability with responsive web design.",
    "engilityName": "Engility",
    "engilityTitle": "Software Engineer",
    "engilitySummary1": "Utilized the following technologies at my tenure:",
    "engilitySummary2":"C#, XMPP, Jabber client, ASP.NET MVC, Razor Webpages, JSON, WPF, WCF, MVVM pattern, MVC pattern, Entity Framework 4-4.5, Bootstrap, Created Plugin’s, JavaScript, JQuery, CSS, HTML, Icon Creation, Photoshop, VS2013, TFS, SQL, Blend, MSWord, MS PowerPoint, MS Visio, and Agile Methodology.",
    "engilitySummary3":"Due to the security risk of the project I will not be able to explain exact roles, tasks performed, or capabilities created.",
    "githubLink": "https://github.com/JohnPJustice",
    "githubTitle": "GitHub",
    "linkedInLink": "https://www.linkedin.com/in/john-paul-justice",
    "linkedInTitle": "LinkedIn",
    "skillSet": "Skill Set"
}
