{
    "mainName" :  "John Paul Justice", 
    "navAbout" :  "Experience", 
    "navContact" :  "Contact Me", 
    "navProjects" :  "Skill Stack", 
    "navTitle" :  "Home", 
    "aboutMe" :  "About Me", 
    "photoOfMe" :  "Recent Photo:", 
    "mainTitle" :  "Senior Site Reliability Engineer / Senior Software Engineer", 
    "mainSummary" :  "Senior Software Engineer with over a decade of experience of software development in the government, gaming, and healthcare industries. Highly skilled in troubleshooting, development operations, familiarity with the software development life cycle, CICD, devops, software methodologies and use of best practices and adopted patterns.", 
    "mainContactMe" :  "Professional Links", 
    "mainExperience" :  "Experience", 
    "nautilusName" :  "Nautilus Inc.", 
    "nautilusPostition" :  "Senior SRE /Senior Software Engineer", 
    "nautilusEmpTime" :  "Aug 2018 - Sept 2019", 
    "jgName" :  "Jahnel Group", 
    "jgPosition" :  "Senior SRE /Senior Software Engineer", 
    "jgEmpTime" :  "Sept 2019 - Present", 
    "capsaEmpTime" :  "Aug 2016 - Aug 2018", 
    "integraEmpTime" :  "Aug 2015 - Aug 2016", 
    "engilityEmpTime" :  "Aug 2014 - Aug 2015", 
    "nautilusSummary" :  "Lead the DevOps Mindset among the teams, by creating project templates for applications in such languages as python, nodejs, dotnetcore and dotnet framework, as well as automating cloudformation code pipelines to speed up development and standardizing source control utilizing the GIT-ﬂow. Setup application monitoring(supporting a kubernetes cluster), synthetic testing(browser scripting using selenium scripting, api tests, browser tests, endpoint tests), logging, tooling automation and webhook integrations supporting proprietary applications and business operations primarily in an AWS infrastructure as code environment. Primary tasks include automating business operations, creating application pipelines for EC2 instances(windows/linux), lambdas,and other various special deployments.", 
    "jgSummary" :  "Implement, test, deploy, maintain and monitor microservices providing the backend service to game studios. Performing continuous integration and delivery of new microservices, on-demand trouble shooting of large-scale deployment issues on Linux and windows systems within a kubernetes environment. Create and maintain automation tools used in the management of the infrastructure. Coordinated deployments with application owners to ensure smooth transitions and minimal user impact. Create and maintain documentation for services, procedures, knowlodge bases, alerts, dashboards and instrumentation for new and existing software.", 
    "capsaName" :  "Capsa Healthcare", 
    "capsaTitle" :  "Senior Software Engineer", 
    "capsaSummary" :  "Research, design, and implement scalable applications for application software, firmware and software interface, application utilities, data configuration, data extraction/retrieval from the ground up. Rapidly prototype new capabilities. Migrated Azure Data server, cloud services, and web applications.", 
    "integraName" :  "Integra telecom", 
    "integraTitle" :  "Software Engineer", 
    "integraSummary" :  "Full stack system engineer responsible for completion of tasks from stories, bugs and other product backlog items/epics. Implemented Deployment builds with unit tests and locked check-ins. Redesigned Customer Website Portal with a focus on responsive web design for optimal mobile capability.", 
    "engilityName" :  "Engility", 
    "engilityTitle" :  "Software Engineer", 
    "engilitySummary" :  "Utilized the following technologies at my tenure,  C#, XMPP, Jabber client, ASP.NET MVC, Razor Webpages, JSON, WPF, WCF, MVVM pattern, MVC pattern, Entity Framework 4-4.5, Bootstrap, Created Plugin’s, JavaScript, JQuery, CSS, HTML, Icon Creation, Photoshop, VS2013, TFS, SQL, Blend, MSWord, MS PowerPoint, MS Visio, and Agile Methodology. Due to the security risk of the project I will not be able to explain exact roles, tasks performed, or capabilities created.", 
    "githubLink" :  "https://github.com/JohnPJustice", 
    "githubTitle" :  "GitHub", 
    "linkedInLink" :  "https://www.linkedin.com/in/john-paul-justice", 
    "linkedInTitle" :  "LinkedIn", 
    "skillSet" :  "Skill Set" 
}