{
    "mainName" :  "John Paul Justice", 
    "navAbout" :  "Experience", 
    "navContact" :  "Contact Me", 
    "navProjects" :  "Skill Stack", 
    "navTitle" :  "Home", 
    "aboutMe" :  "About Me", 
    "photoOfMe" :  "Recent Photo:", 
    "mainTitle" :  "Senior Site Reliability Engineer Consultant", 
    "mainSummary" :  "I am a senior software engineer and site reliability engineer with a passion for creating and maintaining high-quality software systems. I have over 10 years of experience in software development for various industries, such as government, healthcare, and gaming. I have a strong background in troubleshooting, development operations, architecture, software development life cycle, CI/CD, devops, site reliability, software methodologies and use of best practices and adopted patterns. I enjoy working with cutting-edge technologies and solving complex problems. I am always eager to learn new skills and improve my existing ones. I am looking for a challenging and rewarding position where I can apply my expertise and contribute to the success of the organization.", 
    "mainContactMe" :  "Professional Links", 
    "mainExperience" :  "Experience", 
    "nautilusName" :  "Nautilus Inc.", 
    "nautilusPostition" :  "Senior SRE /Senior Software Engineer", 
    "nautilusEmpTime" :  "Aug 2018 - Sept 2019", 
    "jgName" :  "Jahnel Group", 
    "jgPosition" :  "Senior SRE /Senior Software Engineer", 
    "jgEmpTime" :  "Sept 2019 - Present", 
    "capsaEmpTime" :  "Aug 2016 - Aug 2018", 
    "integraEmpTime" :  "Aug 2015 - Aug 2016", 
    "engilityEmpTime" :  "Aug 2014 - Aug 2015", 
    "nautilusSummary" :  "Set up application monitoring for a Kubernetes cluster, synthetic testing, logging, tooling automation, Terraform templates, task automation, and webhook integrations for proprietary applications and business operations. Automate business operations, standardize source control with GIT-flow, create application pipelines for EC2 instances and Lambdas, and create CloudFormation templates. Support and create serverless microservices in C#, Python3.6, and NodeJs.", 
    "jgSummary" :  "Manage game studios’ backend service by implementing, testing, deploying, maintaining, and monitoring microservices/applications. Perform continuous integration and delivery of new microservices/applications and troubleshoot large-scale deployment issues on Linux and Windows systems within a Kubernetes environment. Create and maintain automation tools for infrastructure management, coordinate deployments with application owners, and create documentation for services, procedures, and software. Migrated services from AWS EC2 to Azure Kubernetes AKS and AWS EKS.", 
    "capsaName" :  "Capsa Healthcare", 
    "capsaTitle" :  "Senior Software Engineer", 
    "capsaSummary" :  "Researched, innovated, and designed scalable applications for software, firmware, and interfaces. Implemented new utilities, data configuration, and data extraction for the application infrastructure. Prototyped new capabilities and migrated Azure Data server, cloud services, and web applications.", 
    "integraName" :  "Integra telecom", 
    "integraTitle" :  "Software Engineer", 
    "integraSummary" :  "As a full-stack system engineer, completed tasks from stories, bugs, and other product backlog items/epics. Implemented deployment builds with unit tests and locked check-ins. Redesigned the customer website portal for optimal mobile capability with responsive web design.", 
    "engilityName" :  "Engility", 
    "engilityTitle" :  "Software Engineer", 
    "engilitySummary" :  "Utilized the following technologies at my tenure,  C#, XMPP, Jabber client, ASP.NET MVC, Razor Webpages, JSON, WPF, WCF, MVVM pattern, MVC pattern, Entity Framework 4-4.5, Bootstrap, Created Plugin’s, JavaScript, JQuery, CSS, HTML, Icon Creation, Photoshop, VS2013, TFS, SQL, Blend, MSWord, MS PowerPoint, MS Visio, and Agile Methodology. Due to the security risk of the project I will not be able to explain exact roles, tasks performed, or capabilities created.", 
    "githubLink" :  "https://github.com/JohnPJustice", 
    "githubTitle" :  "GitHub", 
    "linkedInLink" :  "https://www.linkedin.com/in/john-paul-justice", 
    "linkedInTitle" :  "LinkedIn", 
    "skillSet" :  "Skill Set" 
}
